import data from source
import Pandas
Import CSV file

In [1]:
##import pandas
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np
import os


##import inforamtion for world back of population
#with open(r'D:\springboard\DataScienceGuidedCapstone\Unit7\DataCapstoneProject2\data_worldbank_population.csv') as birthratecsvfile:
LaborRate = pd.read_csv(r'D:\springboard\DataScienceGuidedCapstone\Unit7\DataCapstoneProject2\AllLabour_1960_2020.csv',header=0)

In [ ]:
#verify columns names and type of object
#LaborRate.info()

In [ ]:
#Validate if there are duplicate country name and country code.  There does not seem to be any duplicate.
#LaborRate[['CountryName','CountryCode']].nunique()

In [ ]:
#view data and see a lot of NaN, and notice the number XX.XX is actually in millions
#LaborRate.head(25)

In [2]:
#create new df to move data for japan and United states into
LaborRate2 = LaborRate.loc[LaborRate['CountryName'].isin(['Japan','United States'])]
LaborRate2

,CountryName,CountryCode,1960,1961,1962,1963,1964,1965,1966,1967,...,2011,2012,2013,2014,2015,2016,2017,2018,2019,2020
117,Japan,JPN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,42.560001,41.900002,42.599998,43.000000,43.0000,44.799999,44.599998,47.599998,49.299999,NaN
249,United States,USA,56.400002,56.299999,55.799999,55.200001,55.299999,55.799999,57.099998,57.700001,...,54.968899,55.816101,55.049599,55.007801,54.9963,55.164902,55.466400,55.215599,55.876400,NaN

In [3]:
LaborRate2.columns

Index(['CountryName', 'CountryCode', '1960', '1961', '1962', '1963', '1964',
       '1965', '1966', '1967', '1968', '1969', '1970', '1971', '1972', '1973',
       '1974', '1975', '1976', '1977', '1978', '1979', '1980', '1981', '1982',
       '1983', '1984', '1985', '1986', '1987', '1988', '1989', '1990', '1991',
       '1992', '1993', '1994', '1995', '1996', '1997', '1998', '1999', '2000',
       '2001', '2002', '2003', '2004', '2005', '2006', '2007', '2008', '2009',
       '2010', '2011', '2012', '2013', '2014', '2015', '2016', '2017', '2018',
       '2019', '2020'],
      dtype='object')

In [4]:
#drop CountryCode column as it doesnt provide useful data
LaborRate2= LaborRate2.drop(['CountryCode'],axis = 1)
LaborRate2

,CountryName,1960,1961,1962,1963,1964,1965,1966,1967,1968,...,2011,2012,2013,2014,2015,2016,2017,2018,2019,2020
117,Japan,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,55.799999,...,42.560001,41.900002,42.599998,43.000000,43.0000,44.799999,44.599998,47.599998,49.299999,NaN
249,United States,56.400002,56.299999,55.799999,55.200001,55.299999,55.799999,57.099998,57.700001,57.700001,...,54.968899,55.816101,55.049599,55.007801,54.9963,55.164902,55.466400,55.215599,55.876400,NaN

In [5]:
LaborRate2.rename(columns={'CountryName':'Year'},inplace = True)

In [7]:
LaborRate2

,Year,1960,1961,1962,1963,1964,1965,1966,1967,1968,...,2011,2012,2013,2014,2015,2016,2017,2018,2019,2020
117,Japan,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,55.799999,...,42.560001,41.900002,42.599998,43.000000,43.0000,44.799999,44.599998,47.599998,49.299999,NaN
249,United States,56.400002,56.299999,55.799999,55.200001,55.299999,55.799999,57.099998,57.700001,57.700001,...,54.968899,55.816101,55.049599,55.007801,54.9963,55.164902,55.466400,55.215599,55.876400,NaN

In [43]:
#Transpose axis for LaborRate2
LaborRateT = LaborRate2.T
LaborRateT

            117            249
Year      Japan  United States
1960        NaN      56.400002
1961        NaN      56.299999
1962        NaN      55.799999
1963        NaN      55.200001
...         ...            ...
2016  44.799999      55.164902
2017  44.599998        55.4664
2018  47.599998      55.215599
2019  49.299999        55.8764
2020        NaN            NaN

[62 rows x 2 columns]

In [44]:
#header is int64 and needs to be str

LaborRateT.keys()

Int64Index([117, 249], dtype='int64')

In [34]:
# failed to change column header into str

LaborRateT = LaborRateT.columns.astype(str)

In [42]:
LaborRateT

Index(['117', '249'], dtype='object')

In [ ]:
LaborCol.info()

In [ ]:
LaborRateTT = LaborRateT.index

In [ ]:
LaborRateTT

In [ ]:
#flip x and y axis so each year is a row instead of column

x = LaborRate2['CountryName'].iloc[0:3].values.axis =1
print (x)
plt.show(x)